
create table #Msg (Grp1ID int,Grp1Name nvarchar(300), Grp2ID int ,Grp2Name nvarchar(300),Grp3ID int,Grp3Name nvarchar(300),MsgID int,MsgName nvarchar(300));

insert into #Msg values (	'1',	N'服用方式',	'0',	N'0',	'0',	N'0',	'101',	N'每天4粒番茄红素，早餐2粒补充整夜营养消耗；晚餐2粒消除一天疲劳。您的专属健康顾问将为您提供系列健康，敬请留意。')
insert into #Msg values (	'1',	N'服用方式',	'0',	N'0',	'0',	N'0',	'102',	N'每天4粒番茄红素，早2粒晚2粒，分次服用，吸收更充分，您的专属健康顾问将为您提供系列【抗氧小贴士】，敬请留意。')
insert into #Msg values (	'2',	N'成分故事',	'0',	N'0',	'0',	N'0',	'201',	N'您知道吗？过量自由基攻击细胞，会降低细胞的抗氧化修复力。早2粒晚2粒，补充番茄红素对抗自由基，保护细胞的抗氧化修复力。')
insert into #Msg values (	'2',	N'成分故事',	'0',	N'0',	'0',	N'0',	'202',	N'维生素E能消除由紫外线、空气污染等外界因素造成过多自由基，早2粒晚2粒，延缓光老化、预防晒伤和抑制日晒红斑生成等作用。')


insert into #Msg values (	'3',	N'疗程服用',	'0',	N'0',	'0',	N'0',	'301',	N'身体各个器官细胞更新需要一定周期早2粒晚2粒，持续补充6个月以上番茄红素，帮助细胞持续提升抗氧化修复力。   ')
insert into #Msg values (	'3',	N'疗程服用',	'0',	N'0',	'0',	N'0',	'302',	N'从出生起，人类就在与氧化反应进行抗争，抗氧化是持久战，早2粒晚2粒，坚持补充番茄红素和维生素E，保护抗氧化战斗力。')
insert into #Msg values (	'3',	N'疗程服用',	'0',	N'0',	'0',	N'0',	'303',	N'每天早2粒晚2粒补充番茄红素，您可观察记录皮肤和身体状态，对比服用前后的变化。还可与您的专属健康顾问反馈体验，获取更多个性化健康服务。')
insert into #Msg values (	'4',	N'健康提示',	'1',	N'膳食营养',	'0',	N'0',	'401',	N'高油高脂的单一饮食结构导致维生素、矿物质等营养缺乏，带来健康问题和疾病风险，建议每日蔬果摄入量最低500克，早2粒晚2粒补充番茄红素和维生素E，为身体补充全面营养。')
insert into #Msg values (	'4',	N'健康提示',	'2',	N'合理运动',	'0',	N'0',	'402',	N'什么是适合自己的运动呢？运动中全身微出汗是最好的，微出汗既排出了体内的毒素，又使得肌肉得到适度的舒展。记得早2粒晚2粒全面补充营养哦。')
insert into #Msg values (	'4',	N'健康提示',	'3',	N'生活方式',	'0',	N'0',	'403',	N'如今很多人都是“今天睡今天起”，你是不是也这样呢？中国睡眠研究会提醒：睡太多或太少都会导致大脑衰老提前4~7年。每天早2粒晚2粒，提高抗氧化力。')
insert into #Msg values (	'4',	N'健康提示',	'4',	N'心理健康',	'0',	N'0',	'404',	N'过度的焦虑情绪会使工作效率变低，甚至引发身体疼痛，可以通过运动平静、放松，同时每天早2粒晚2粒，提高身体机能。')
insert into #Msg values (	'5',	N'健康危机',	'1',	N'乳腺',	'0',	N'0',	'501',	N'妖娆曲线少不了健康的乳房，70%~80%的女性都有不同程度的乳腺增生，每天早2粒晚2粒，保证足量的营养摄入，保护乳腺健康。')
insert into #Msg values (	'5',	N'健康危机',	'2',	N'前列腺',	'0',	N'0',	'502',	N'50%男性会受前列腺问题困扰，前列腺炎的症状有尿频、尿急、尿不尽、尿道疼痛、性功能异常等，如有上述情况建议及时就医，每天早2粒晚2粒，保护前列腺健康。')
insert into #Msg values (	'5',	N'健康危机',	'3',	N'心血管',	'0',	N'0',	'503',	N'高血压是心血管病的首要危险因素，每5个成年人就有1人患高血压。如此高的发病率提醒我们，日常需注重自身健康管理，每天早2粒晚2粒，保护前心血管健康。')
insert into #Msg values (	'5',	N'健康危机',	'4',	N'肌肤',	'0',	N'0',	'504',	N'皮肤被紫外线辐射过后，皮肤里的番茄红素最先被破坏，会减少31%-46%，每天早2粒晚2粒，及时补充番茄红素可在肌肤表层形成一道屏障，保护皮肤免受紫外线损伤。')
insert into #Msg values (	'6',	N'健康干预',	'1',	N'乳腺',	'1',	N'膳食营养',	'601',	N'高脂高热量饮食促使雌激素分泌增多，导致乳腺细胞过度增殖，引发乳腺疾病。每天早2粒晚2粒，补充必要营养素，保护和改善乳腺健康。')
insert into #Msg values (	'6',	N'健康干预',	'1',	N'乳腺',	'2',	N'合理运动',	'602',	N'定期检查可预防乳房疾病，大于20岁每月自我检查，20~40岁每年接受专科医生检查，40岁以上的每半年检查，每天早2粒晚2粒，保护和乳腺健康。')
insert into #Msg values (	'6',	N'健康干预',	'1',	N'乳腺',	'3',	N'生活方式',	'603',	N'体内脂肪含量高导致雌激素分泌过多，引发各种乳腺疾，建议适量运动有效减脂，每天早2粒晚2粒，提高身体抗氧化力，有效清除自由基。')
insert into #Msg values (	'6',	N'健康干预',	'1',	N'乳腺',	'4',	N'心理健康',	'604',	N'压力过大带来脾气暴躁情绪不佳，导致过量自由基产生免疫力下降，易引发女性乳腺癌，平时适量运动，每天早2粒晚2粒补充抗氧化营养，有效清除自由基。')
insert into #Msg values (	'6',	N'健康干预',	'2',	N'前列腺',	'1',	N'膳食营养',	'605',	N'酒精或辛辣刺激性食物会刺激前列腺肥大，建议清淡饮食，减少饮酒，每天早2粒晚2粒补充抗氧化营养素，保护前列腺健康。')
insert into #Msg values (	'6',	N'健康干预',	'2',	N'前列腺',	'2',	N'合理运动',	'606',	N'久坐会造成前列腺长期受压血流不畅，易引发前列腺疾病，建议每隔30分钟~1小时站立或活动，每天早2粒晚2粒补充抗氧化营养素，缓解前列腺压力。')
insert into #Msg values (	'6',	N'健康干预',	'2',	N'前列腺',	'3',	N'生活方式',	'607',	N'规律的体育运动，如深蹲、散步利于加快前列腺器官血液循环，缓解前列腺充血。每天早2粒晚2粒补充抗氧化营养素，缓解前列腺压力。')
insert into #Msg values (	'6',	N'健康干预',	'2',	N'前列腺',	'4',	N'心理健康',	'608',	N'对前列腺疾病缺乏足够认识导致的心理障碍，会影响治疗效果，保持乐观心态积极治疗，早2粒晚2粒及时补充营养素，利于病情控制和治疗。')
insert into #Msg values (	'6',	N'健康干预',	'3',	N'心血管',	'1',	N'膳食营养',	'609',	N'重口味、爱吃咸、爱吃糖对心脏都不好，平衡膳食多吃绿叶菜及粗纤维谷物。每天早2粒晚2粒，全面补充植物营养素，守护心脏健康。')
insert into #Msg values (	'6',	N'健康干预',	'3',	N'心血管',	'2',	N'合理运动',	'610',	N'减少或杜绝吸烟，是最重要的预防心血管疾病的手段之一，每天早2粒晚2粒，清除抽烟或二手烟带来的过量自由基，保护心血管健康。')
insert into #Msg values (	'6',	N'健康干预',	'3',	N'心血管',	'3',	N'生活方式',	'611',	N'肥胖是心血管疾病的危险因素，合理的身体质量指数（BMI）需低于25，你的BMI指数达标了吗？每天早2粒晚2粒，补充植物营养素，保护心血管；')
insert into #Msg values (	'6',	N'健康干预',	'3',	N'心血管',	'4',	N'心理健康',	'612',	N'美国印第安纳州纪念医院临床试验结果显示，每天笑15秒钟可延长2天寿命，平时不妨多笑笑释放压力，每天早2粒晚2粒补充植物营养素，一起保护心脏。')
insert into #Msg values (	'6',	N'健康干预',	'4',	N'肌肤',	'1',	N'膳食营养',	'613',	N'油腻辛辣饮食会从内部破坏皮肤营养和平衡，出现痤疮或其他皮肤炎症，饮食上尽量少糖少脂多蔬多果。每天早2粒晚2粒补充足量植物营养素，提升肌肤抗氧力')
insert into #Msg values (	'6',	N'健康干预',	'4',	N'肌肤',	'2',	N'合理运动',	'614',	N'每天运动可以放松身体舒活肌肤，促进肌肤血液循环，每天早2粒晚2粒及时补充番茄红素和维生素E，内外调养保持肌肤营养活力。')
insert into #Msg values (	'6',	N'健康干预',	'4',	N'肌肤',	'3',	N'生活方式',	'615',	N'想要牛奶皮肤？卸妆洗脸要到位：35℃水温最佳，既能保证毛孔充分张开又不会使皮肤天然保湿油分丢失。每天早2粒晚2粒内外兼修补充肌肤营养！')
insert into #Msg values (	'6',	N'健康干预',	'4',	N'肌肤',	'4',	N'心理健康',	'616',	N'压力过大或焦虑易导致压力痘、细纹、黑眼圈出现，一要及时请教皮肤医生二要解压舒郁，每天早2粒晚2粒及时补充抗氧化营养素，一起守护肌肤健康！')
insert into #Msg values (	'7',	N'复购提醒',	'0',	N'0',	'0',	N'0',	'701',	N'坚持服用怡日健番茄红素维生素E软胶囊，为身体持续补充足量的抗氧化营养素，您是否感到身体状态越来越好？如果即将用完可联系您的专属健康顾问续购，或咨询更多健康资讯。')

select * from #Msg

select Grp1ID ,MsgID ,MsgName
from (
select Grp1ID ,MsgID ,MsgName , RN = row_number() over (partition by Grp1ID ORDER BY newid())
from #Msg) as T
where RN=1

select top 1 newid() as id,  dc.ConsultantKEY from dm.DimConsultant dc  order by 1  
